benchmarks/OpenFOAM/2D/risingBubble/N160/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    rightWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    bottomWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    topWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    backWall
    {
        type            empty;
    }

    frontWall
    {
        type            empty;
    }
}

// ************************************************************************* //
